# Типы данных в питоне

# 1. NoneType - ничего, пустота -> None 
# 2. Boolean - истина или ложь -> True/False
# 3. str() - строки -> "Hello world", 'My name is John'
# 4. Числовые типы данных:
#       a. integer - int() - Целое число (-1, -2, 0, 1)
#       b. float() - Число с плавающей точкой (-1.2, 10.15, 2.7)
#       c. complex() - Комплексные числа (3+516)
# 5. Cписковые тип данных:
#       a. list(список/массив) -> (1, 2, 3, None, 'Hello', True, False, [1, 2, 3])    
#       b. tuple(кортеж) -> (1, 2, 3, 4, None)
#       c. range(последовательность) -> range(1, 10)
# 6. set() -> Множества
# 7. dict(словарь) -> содержит данные в виде ключа и значения -> {1: 'One', 2: 'Two'}
# 
# ------------------------------------------------------------------------ 
# 
# Mutable(изменяемые типы данных)
#   1. list
#   2. set
#   3. dict
# 
# Immutable(неизменяемые типы данных) 
#   1. NoneType
#   2. boolean
#   3. int float complex
#   4. str
#   5. range
#   6. tuple
#   7. frozenset
# 
# -------------------------------------------------------------------------
#  
#  Стандартный вывод данных
#  В пайтоне для вывода данных в терминал используется встренная функция  print()
#
# print('Hello world, my name is John')
# print(27+5)
# 
#  Стандартный ввод данных
#  Через терминал используется функция input()
# 
# a=input('Введите число: ')
# print('В a хранится: ')
# print(a)
